#### PolylineNode Members

---

|  |
| --- |
| PolylineNode Class   Methods   Properties   See Also |

The  PolylineNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPolyline | Returns the polyline object corresponding to the node. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | LineProperties | Access to the line (pen) properties of the curve being drawn (Inherited from  ModelCurveNode  .) |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |

# See Also

PolylineNode Class

Autodesk.Revit.DB Namespace